;;
;; Exercise 1.1
;;

10

;;
(+ 5 3 4)

;;
(- 9 1)

;;
(/ 6 2)

;;
(+ (* 2 4) (- 4 6))

;;
(define a 3)

;;
(define b (+ a 1))

;;
(+ a b (* a b))

;;
(= a b)

;;
(if (and (> b a) (< b (* a b)))
    b
    a)

;;
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))

;;
(+ 2 (if (> b a) b a))

;;
(* (cond ((> a b) a)
         ((< a b) b)
         (else -1 ))
   (+ a 1))

;; 不要認為以上是很簡單的練習,  以上把本書三大作者要講的Scheme
;; 語言的基礎全部考察了( 表達式, 復合表達式, 復合過程); 如果和
;; 本書第四/五章的內容來寫一個"求值器"來實現以上的基礎, 就不那
;; 么容易了(需要思考很多數學模型, 計算模型和過程抽象 ...)
