;;
;; Exercise 1.45
;;
;; 使用前面的三個過程組合, 就可以了; 如下:

(define (common-fn n x)  
  (fixed-point ((repeated average-damp (- n 1)) 
        (lambda (y) (/ x (expt y (- n 1)))))
           1.0))

;; 使用時: (common-fn 2 5) => 2.236067977499978 (求平方根)
;;         使用系統過程(sqrt 5) => 2.23606797749979
;;         運算速度common-fn和sqrt差不多; 又如:
;;         (common-fn 2 10000000000000000000000000000)
;;         => 1e+14
;;         (sqrt 10000000000000000000000000000) 
;;         => 100000000000000
;;
;;         (common-fn 3 5) => 1.7099779004121451(求立方根)
;
;; 總結:   以前章節中, 我對牛頓法的"可計算性"是比較懷疑, 因
;;         為比起系統中sqrt過程, 我們的樸素方法慢太多了; 但
;;         通過使用本節的內容"不動點", "平均阻尼"和"計算n次
;;         方根" 可以看出以上common-fn過程的速度幾乎和系統
;;         中的sqrt相同. 
